### Name:       Ghulam Mustafa
### Roll:       FA22-BSCS-188
### Section:    E
____________________________________
# ASSIGNMENT:  DATA PRE-PROCESSING
# AI LAB

____________________

## LOAN DATASET PRE PROCESSING

________________

        Imports

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

        Data Import

In [2]:
data = pd.read_csv('loan_data.csv')

In [3]:
data.head()

                                                Text  ...  Approval
0  I need a loan to pay for an international vaca...  ...  Rejected
1  I want to make home improvements like installi...  ...  Rejected
2  I need a loan for home renovation, including a...  ...  Rejected
3  I need funds to buy new furniture and applianc...  ...  Rejected
4           I need a loan to start a small business.  ...  Approved

[5 rows x 7 columns]

In [4]:
data.describe()

              Income  Credit_Score    Loan_Amount     DTI_Ratio
count   24000.000000  24000.000000   24000.000000  24000.000000
mean   110377.552708    575.720333   44356.154833     34.719167
std     51729.677627    159.227621   34666.604785     32.322471
min     20001.000000    300.000000    1005.000000      2.530000
25%     65635.750000    437.000000   16212.000000     14.507500
50%    110464.000000    575.000000   35207.000000     24.860000
75%    155187.000000    715.000000   65622.750000     41.840000
max    200000.000000    850.000000  158834.000000    246.330000

In [5]:
data.shape

(24000, 7)

_____________________

### HANDLING MISSING DATA

 We are gonna fill all columns with missing values, with mean, mode and median values

In [7]:
data['Income'] = data['Income'].fillna(data['Income'].median())
data['Credit_Score'] = data['Credit_Score'].fillna(data['Credit_Score'].median())
data['Loan_Amount'] = data['Loan_Amount'].fillna(data['Loan_Amount'].median())
data['DTI_Ratio'] = data['DTI_Ratio'].fillna(data['DTI_Ratio'].mean())
data['Employment_Status'] = data['Employment_Status'].fillna(data['Employment_Status'].mode()[0])
data['Approval'] = data['Approval'].fillna(data['Approval'].mode()[0])

### Dropping Duplicates

In [8]:
data.drop_duplicates(inplace=True)

### DELETING UN NECESSARY COLUMNS

In [9]:
data.drop(columns=['Text'], inplace=True)

In [10]:
data.head()

   Income  Credit_Score  Loan_Amount  DTI_Ratio Employment_Status  Approval
0   26556           581         8314      79.26          employed  Rejected
1  197392           389       111604      22.14          employed  Rejected
2   44561           523        34118      45.44          employed  Rejected
3  190363           729       118757      10.22        unemployed  Rejected
4   61853           732        19210      44.13          employed  Approved

## Convert target column to binary

In [11]:
data['Approval'] = data['Approval'].map({'Rejected': 0, 'Approved': 1})

In [12]:
data['Employed'] = data['Employment_Status'].map({'employed': 1, 'unemployed': 0})
data.drop(columns=['Employment_Status'], inplace=True)

In [13]:
data.head()

   Income  Credit_Score  Loan_Amount  DTI_Ratio  Approval  Employed
0   26556           581         8314      79.26         0         1
1  197392           389       111604      22.14         0         1
2   44561           523        34118      45.44         0         1
3  190363           729       118757      10.22         0         0
4   61853           732        19210      44.13         1         1

## TEST - TRAIN SPLIT

In [14]:
X = data.drop('Approval', axis=1)
y = data['Approval']

In [15]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=42)

In [17]:
print("X_train Shape:  ", X_train.shape)
print("y_train Shape:  ", y_train.shape)
print("X_test Shape:  ", X_test.shape)
print("y_test Shape:  ", y_test.shape)

X_train Shape:   (16800, 5)
y_train Shape:   (16800,)
X_test Shape:   (7200, 5)
y_test Shape:   (7200,)